#ifndef PIT_H
#define PIT_H


//#include "CAN.h"
//#include "Srec.h"

//构件函数声明区

    //TimerInit:定时器初始化函数--------------------------------------------*
    //功  能:定时器初始化，中断一次时间为1/2秒                              *
    //参  数:channel==0~7, MUXSEL:0-选择微时基0；1-选择微时基1
    // MTLD:填入微定时器加载寄存器的值， LD：填入通道加载寄存器的值         *                                                             *
    //返  回:无                                                             *
    //----------------------------------------------------------------------*
    //void PITInit(uint8 channel,uint8 MUXSEL,uint8 MTLD,uint16 LD);
    void init_PIT0(void);
    //void init_PIT1(void);
    //----------------------------------------------------------------------*
    //函数名: SecAdd1(计时函数)                                             *
    //功  能: 以秒为最小单位递增时,分,秒缓冲区的值(00:00:00-23:59:59)       *
    //参  数: *p:计数变量的首地址                                           *
    //返  回: 无                                                            *
    //----------------------------------------------------------------------*

#endif