/*=======================================================================
 *Subsystem:   裸机
 *File:        ADC_Config.h
 *Author:      WenYuhao
 *Description: 
 ========================================================================
 * History:    
 * 1. Date:
      Author:
      Modification:
========================================================================*/

#ifndef _ADC_CONFIG_H_
#define _ADC_CONFIG_H_

  /*=============================================================================
                                  宏定义参数配置
  ==============================================================================*/
  #define Stand_Volt          4.500              //宏定义基准电压 //原4.927
  #define Hall_Range          750              //霍尔传感器的量程
  //#define Trans_Volt          20049.9/49.9     //宏定义总压转换分压电阻为5M，49.9K
  
  /*=============================================================================
                                      通道配置
  ==============================================================================*/
  #define VoltageChannel2     9                //宏定义电压检测通道
  #define VoltageChannel9     2                //宏定义电压检测通道

  #define QCharge_CC2         9      

  #define HallChannel         7                 //宏定义霍尔传感器通道


#endif