/*=======================================================================
 *Subsystem:   裸机
 *File:        main.C
 *Author:      Wenm
 *Description: 通信：
               接口：
               波特率：
 ========================================================================
 * History:    修改历史记录列表
 * 1. Date:    
      Author:  
      Modification:          
========================================================================*/

#include "PIT.h"

/*=======================================================================
 *函数名:      主函数函数
 *功能:        1.系统初始化；
               2.任务函数的创建，
               3.任务的轮询
 *参数:        无 
 *返回：       无
 *说明：       包含各个初始化和任务的执行
========================================================================*/  
void main(void) 
{ 
  //System_init(); //系统底层函数初始化  
  //此处轮询用于自检,自检成功则立马跳出(0:自检成功,1:自检失败,需要继续自检)
  for(;;) 
  {
     Task_Handle();//任务轮询
  } 
}